In [2]:
import pandas as pd
import seaborn as sns

In [18]:
df = pd.read_csv("Student_Records_202206231920.csv")
df

   Student_Id First_Name     Address  Age  Percentage Grade
0           5      Fajar     Sahiwal   20          75    B1
1         201   Ehtisham       Okara   18          89    A2
2         202        Ali      Lahore   19          93    A1
3         203      Fizaa       Okara   20          89    A2
4         204      Ahmed      Lahore   19          78    B1
5         206     Multan      Salman   19          51    C1
6         207       Azka  Rawalpandi   20          62    B2

In [21]:
df['Grade'].value_counts()

B1    2
A2    2
A1    1
C1    1
B2    1
Name: Grade, dtype: int64

In [6]:
df.describe()

       Student_Id        Age  Percentage
count    7.000000   7.000000    7.000000
mean   175.428571  19.285714   76.714286
std     75.181685   0.755929   15.542568
min      5.000000  18.000000   51.000000
25%    201.500000  19.000000   68.500000
50%    203.000000  19.000000   78.000000
75%    205.000000  20.000000   89.000000
max    207.000000  20.000000   93.000000

In [4]:
df[df['Address'] =='Lahore']

   Student_Id First_Name Address  Age  Percentage Grade
2         202        Ali  Lahore   19          93    A1
4         204      Ahmed  Lahore   19          78    B1

In [8]:
df['Address'].value_counts()

Okara         2
Lahore        2
Sahiwal       1
Salman        1
Rawalpandi    1
Name: Address, dtype: int64

In [12]:
# sns.countplot(df['Address'])

#### Ordered By or Sorting

In [21]:
df.sort_values('Percentage', ascending=True)

   Student_Id First_Name     Address  Age  Percentage Grade
5         206     Multan      Salman   19          51    C1
6         207       Azka  Rawalpandi   20          62    B2
0           5      Fajar     Sahiwal   20          75    B1
4         204      Ahmed      Lahore   19          78    B1
1         201   Ehtisham       Okara   18          89    A2
3         203      Fizaa       Okara   20          89    A2
2         202        Ali      Lahore   19          93    A1

#### Unique Method

In [5]:
df[['Age','Grade']].unique()

AttributeError: 'DataFrame' object has no attribute 'unique'

In [7]:
!ls

 images					     'SQL vs Pandas.ipynb'
'Introduction to SQL.ipynb'		      Student_Records_202206231920.csv
 README.md				      world-university-rankings-202223
'SQL interview Questions and Answers.ipynb'

In [8]:
!ls world-university-rankings-202223

2023_QS_World_University_Rankings.csv

In [9]:
path = "world-university-rankings-202223/2023_QS_World_University_Rankings.csv"
df2 = pd.read_csv(path)

In [10]:
df2.head()

,Rank,institution,location code,location,ar score,ar rank,er score,er rank,fsr score,fsr rank,...,cpf rank,ifr score,ifr rank,isr score,isr rank,irn score,irn rank,ger score,ger rank,score scaled
0,1,Massachusetts Institute of Technology (MIT),US,United States,100.0,5,100.0,4,100.0,14,...,5,100.0,54,90.0,109,96.1,58,100.0,3,100
1,2,University of Cambridge,UK,United Kingdom,100.0,2,100.0,2,100.0,11,...,55,100.0,60,96.3,70,99.5,6,100.0,9,98.8
2,3,Stanford University,US,United States,100.0,4,100.0,5,100.0,6,...,9,99.8,74,60.3,235,96.3,55,100.0,2,98.5
3,4,University of Oxford,UK,United Kingdom,100.0,3,100.0,3,100.0,8,...,64,98.8,101,98.4,54,99.9,3,100.0,7,98.4
4,5,Harvard University,US,United States,100.0,1,100.0,1,99.4,35,...,2,76.9,228,66.9,212,100.0,1,100.0,1,97.6

In [12]:
df2.isnull().sum()

Rank              0
institution       0
location code     0
location          0
ar score          0
ar rank           0
er score          1
er rank           0
fsr score         2
fsr rank          0
cpf score         5
cpf rank          0
ifr score        98
ifr rank         98
isr score        57
isr rank         57
irn score        13
irn rank         13
ger score        12
ger rank         12
score scaled      0
dtype: int64

In [13]:
df2.columns

Index(['Rank', 'institution', 'location code', 'location', 'ar score',
       'ar rank', 'er score', 'er rank', 'fsr score', 'fsr rank', 'cpf score',
       'cpf rank', 'ifr score', 'ifr rank', 'isr score', 'isr rank',
       'irn score', 'irn rank', 'ger score', 'ger rank', 'score scaled'],
      dtype='object')

In [35]:
df2[(df2['location code'] =="PK" ) & (df2['Rank']<1000)]

,Rank,institution,location code,location,ar score,ar rank,er score,er rank,fsr score,fsr rank,...,cpf rank,ifr score,ifr rank,isr score,isr rank,irn score,irn rank,ger score,ger rank,score scaled
333,334,National University of Sciences And Technology...,PK,Pakistan,18.2,474,67.7,104,77.0,154,...,601+,3.0,601+,5.7,601+,55.5,601+,14.6,601+,32
364,365,Quaid-i-Azam University,PK,Pakistan,15.4,501+,38.4,245,2.6,601+,...,41,3.8,601+,2.6,601+,59.2,578,16.6,601+,30.2
389,390,Pakistan Institute of Engineering and Applied ...,PK,Pakistan,5.2,501+,8.2,501+,86.4,104,...,310,NaN,NaN,NaN,NaN,23.4,601+,91.2,60,29.1
614,615,Lahore University of Management Sciences (LUMS),PK,Pakistan,14.9,501+,67.6,107,32.1,480,...,601+,9.0,601+,2.1,601+,18.8,601+,92.7,54,-
962,963,University of Engineering & Technology (UET) L...,PK,Pakistan,7.6,501+,42.9,221,15.4,601+,...,601+,1.1,601+,4.3,601+,38.2,601+,34.8,368,-
985,986,University of Peshawar,PK,Pakistan,5.4,501+,6.8,501+,38.6,401,...,601+,NaN,NaN,2.2,601+,42.7,601+,22.5,539,-
989,990,University of the Punjab,PK,Pakistan,13.5,501+,50.1,173,5.4,601+,...,601+,3.3,601+,1.3,601+,43.7,601+,26.8,467,-

In [17]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1422 entries, 0 to 1421
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           1422 non-null   int64
 1   institution    1422 non-null   object
 2   location code  1422 non-null   object
 3   location       1422 non-null   object
 4   ar score       1422 non-null   float64
 5   ar rank        1422 non-null   object
 6   er score       1421 non-null   float64
 7   er rank        1422 non-null   object
 8   fsr score      1420 non-null   float64
 9   fsr rank       1422 non-null   object
 10  cpf score      1417 non-null   float64
 11  cpf rank       1422 non-null   object
 12  ifr score      1324 non-null   float64
 13  ifr rank       1324 non-null   object
 14  isr score      1365 non-null   float64
 15  isr rank       1365 non-null   object
 16  irn score      1409 non-null   float64
 17  irn rank       1409 non-null   object
 18  ger score      1410 non-null   float64
 19  ger rank       1410 non-null   object
 20  score scaled   1422 non-null   object
dtypes: float64(8), int64(1), object(12)
memory usage: 233.4+ KB

In [28]:
df2.shape

(1422, 21)